Repository: Turista838/Weather_App_Flutter
Catalog: lib/l10n/intl_*.arb
Languages: pt

# meteoDaysThree
source: 3 days
pt: 3 dias

# meteoDaysFive
source: 5 days
pt: 5 dias

# meteoDaysSeven
source: 7 days
pt: 7 dias

# ApiLanguage
source: en
pt: pt

# lastTimeUpdate
source: Last update:
pt: Última actualização:

# currentTemp
source: Current Temperature:
pt: Temperatura actual:

# forecastDate
source: Weather forecast: {day} / {month}
pt: Previsão dia: {day} / {month}

# serviceNotAvailabe
source: Service not available
pt: Serviço não disponivel

source: Service denied
pt: Serviço negado

# updateNeeded
source: You need to update
pt: É necessário actualizar

source: Update
pt: Actualizar

# weatherDetails
source: Forecast details
pt: Detalhes da previsão

# humidity
source: Humidity: {humidity}%
pt: Humidade: {humidity}%

# rain
source: Rain prob.:
pt: Prob. chuva:

# wind
source: Wind: {wind} km/h
pt: Vento: {wind} km/h

# uv
source: UV Index: {uv}
pt: Index UV: {uv}

# forecastDateDetails
source: Weather forecast {day} / {month}
pt: Previsão do dia {day} / {month}

# aboutCredits
source: Created by: Gonçalo Ramalho AMOV 21/22 - ISEC
pt: Criado por: Gonçalo Ramalho AMOV 21/22 - ISEC

# LocationDeniedForever
source: Location permission denied forever by the system. It is necessary to authorize location services through system settings!
pt: Permissão de localização negada para sempre pelo sistema. É necessário autorizar os serviços de localização através das definições do sistema!
